#+TITLE: The sine function
#+OPTIONS: toc:nil num:nil author:nil email:nil
#+AUTHOR: Jordan Schupbach
#+EMAIL: jordans1882@gmail.com

** Testing out c++ includes code chunks

#+begin_src C++ :includes "/usr/include/eigen3/Eigen/Dense" :compiler-args -O3 :flags -std=c++20 :results output

  #include <iostream>
  #include <vector>
  #include <random>
  #include <range/v3/all.hpp>
  #include <iostream>
  #include <Eigen/Dense>

  auto generateMatrix(int n, int m) {
      std::random_device rd;
      std::mt19937 gen(rd());
      std::normal_distribution<double> dist(0.0, 1.0);
      auto rng = ranges::views::iota(0, n) | ranges::views::transform([&](int) {
          return ranges::views::iota(0, m) | ranges::views::transform([&](int) {
              return dist(gen);
          });
      });
      return rng | ranges::views::transform([](auto&& range) {
          return ranges::to<std::vector<double>>(range);
      }) | ranges::to<std::vector<std::vector<double>>>();
  }

  int main() {
      int n = 6;
      int m = 6;

      const auto matrix = generateMatrix(n, m);

      // Print the matrix
      for (const auto& row : matrix) {
          for (double element : row) {
              std::cout << element << " ";
          }
          std::cout << std::endl;
      }

      return 0;
  }
#+end_src

#+RESULTS:

Here's a code chunk in C++ taking 10000 samples from the shake-a-day wait-time
distribution:

#+begin_src C++ :compiler-args -O3 :flags -std=c++20 :results output
  #include <iostream>
  #include <vector>
  #include <numeric>
  #include <random>
  #include <algorithm>
  #include <chrono>

  int runif(int lower, int upper) {
    int random_number = (rand() % (upper - lower + 1)) + lower;
    return random_number;
  }

  std::array<int, 5> shake_a_day_roll() {
    std::array<int, 5> ret;
    for(int i=0; i<5; i++) {
      ret[i] = runif(1, 6);
    }
    return ret;
  }


  bool is_yatzee(const std::array<int, 5> roll) {
    int num = roll[0];
    for (int i = 1; i < 5; i++) {
      if (roll[i] != num) {
        return false;
      }
    }
    return true;
  }

  int sample_wait_time() {
    int count = 0;
    while(!is_yatzee(shake_a_day_roll())) {
      count += 1;
    }
    return count;
  }

  int main() {

    int nsamples = 10000;
    std::array<int, 10000> wait_times;
    auto start = std::chrono::high_resolution_clock::now();
    for(int i=0; i<nsamples; i++) {
      wait_times[i] = sample_wait_time();
    }
    auto end = std::chrono::high_resolution_clock::now();
    auto duration = std::chrono::duration_cast<std::chrono::microseconds>(end - start);
    std::cout << "Elapsed time: " << static_cast<double>(duration.count()) / 1000000.0 << " seconds" << std::endl;
    int sum = std::accumulate(wait_times.begin(), wait_times.end(), 0);
    std::cout << "Estimate of mean (avg) = " << static_cast<double>(sum) / nsamples;

  }
#+end_src

#+RESULTS:
: Elapsed time: 0.797054 seconds
: Estimate of mean (avg) = 1297.43


We see that it only took 8.2243 seconds to compute the 50000 samples resulting
in an estimated rate parameter for the exponential distribution being 1298.31
(as opposed to)


#+begin_src C++ :compiler-args -O3 :flags -std=c++20 :results output
  #include <iostream>
  #include <cmath>

  namespace dm {
  double sin(double x) {
    int n = 10;
    double result = 0.0;
    int sign = 1;
    for (int i = 1; i <= n; ++i) {
      result += sign * std::pow(x, 2 * i - 1) / std::tgamma(2 * i);
      sign *= -1;
    }
    return result;
  }
}

  int main() {

      double x = 0.5;
      double sinx = dm::sin(x);
      std::cout << "Taylor series approximation of sin(" << x << ") = " << sinx << std::endl;

      return 0;
  }


#+end_src

#+RESULTS:
: Taylor series approximation of sin(0.5) = 0.479426
